tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
// SPDX-FileCopyrightText: 2017 WCH <wch-ic.com>
// SPDX-FileCopyrightText: 2022 Tillitis AB <tillitis.se>
// SPDX-License-Identifier: MIT

/********************************** (C) COPYRIGHT *******************************
 * File Name          : CDC.C
 * Author             : WCH
 * Version            : V1.0
 * Date               : 2017/03/01
 * Description        : CH554 as CDC device to serial port, select serial port 1
 *******************************************************************************/
#include <stdint.h>
#include <string.h>

#include <ch554.h>
#include <ch554_usb.h>

#include "config.h"
#include "debug.h"
#include "flash.h"
#include "io.h"
#include "lib.h"
#include "mem.h"
#include "print.h"
#include "usb_strings.h"

XDATA AT0000 uint8_t Ep0Buffer[3*MAX_PACKET_SIZE] = { 0 }; // Endpoint 0, Default endpoint, OUT & IN buffer[64], must be an even address +
                                                           // Endpoint 4, DEBUG endpoint, buffer OUT[64]+IN[64], must be an even address
XDATA AT00C0 uint8_t Ep1Buffer[DEFAULT_EP1_SIZE]  = { 0 }; // Endpoint 1, CDC Ctrl endpoint, IN[8] buffer
XDATA AT00C8 uint8_t Ep2Buffer[2*MAX_PACKET_SIZE] = { 0 }; // Endpoint 2, CDC Data endpoint, buffer OUT[64]+IN[64], must be an even address
XDATA AT0148 uint8_t Ep3Buffer[2*MAX_PACKET_SIZE] = { 0 }; // Endpoint 3, FIDO endpoint, buffer OUT[64]+IN[64], must be an even address

IDATA uint16_t SetupLen = 0;
IDATA uint8_t SetupReq = 0;
IDATA uint8_t UsbConfig = 0;
const uint8_t *pDescr = NULL;         // USB configuration flag

#define UsbSetupBuf                   ((PUSB_SETUP_REQ)Ep0Buffer)

#define CDC_CTRL_EPOUT_ADDR            0x01              // CDC Ctrl Endpoint OUT Address
#define CDC_CTRL_EPOUT_SIZE            DEFAULT_EP1_SIZE  // CDC Ctrl Endpoint OUT Size

#define CDC_CTRL_EPIN_ADDR             0x81              // CDC Ctrl Endpoint IN Address
#define CDC_CTRL_EPIN_SIZE             DEFAULT_EP1_SIZE  // CDC Ctrl Endpoint IN Size

#define CDC_DATA_EPOUT_ADDR            0x02              // CDC Data Endpoint OUT Address
#define CDC_DATA_EPOUT_SIZE            MAX_PACKET_SIZE   // CDC Data Endpoint OUT Size

#define CDC_DATA_EPIN_ADDR             0x82              // CDC Data Endpoint IN Address
#define CDC_DATA_EPIN_SIZE             MAX_PACKET_SIZE   // CDC Data Endpoint IN Size

#define FIDO_EPOUT_ADDR                0x03              // FIDO Endpoint OUT Address
#define FIDO_EPOUT_SIZE                MAX_PACKET_SIZE   // FIDO Endpoint OUT Size

#define FIDO_EPIN_ADDR                 0x83              // FIDO Endpoint IN Address
#define FIDO_EPIN_SIZE                 MAX_PACKET_SIZE   // FIDO Endpoint IN Size

#define CCID_BULK_EPOUT_ADDR           0x03              // CCID Bulk Endpoint OUT Address
#define CCID_BULK_EPOUT_SIZE           MAX_PACKET_SIZE   // CCID Bulk Endpoint OUT Size

#define CCID_BULK_EPIN_ADDR            0x83              // CCID Bulk Endpoint IN Address
#define CCID_BULK_EPIN_SIZE            MAX_PACKET_SIZE   // CCID Bulk Endpoint IN Size

#define DEBUG_EPOUT_ADDR               0x04              // DEBUG Endpoint OUT Address
#define DEBUG_EPOUT_SIZE               MAX_PACKET_SIZE   // DEBUG Endpoint OUT Size

#define DEBUG_EPIN_ADDR                0x84              // DEBUG Endpoint IN Address
#define DEBUG_EPIN_SIZE                MAX_PACKET_SIZE   // DEBUG Endpoint IN Size

#define CDC_CTRL_FS_BINTERVAL          32                // Gives 32 ms polling interval at Full Speed for interrupt transfers
#define CDC_DATA_FS_BINTERVAL          0                 // bInterval is ignored for BULK transfers
#define FIDO_FS_BINTERVAL              2                 // Gives 2 ms polling interval at Full Speed for interrupt transfers
#define CCID_BULK_FS_BINTERVAL         0                 // bInterval is ignored for BULK transfers
#define DEBUG_FS_BINTERVAL             2                 // Gives 2 ms polling interval at Full Speed for interrupt transfers

#define MAX_CFG_DESC_SIZE              (9+66+77+32)      // Size of CfgDesc+CdcDesc+MAX(FidoDesc,CcidDesc)+DebugDesc

#define NUM_INTERFACES                 4                 // Number of interfaces

#define CHANGE_ME                      0x00              // Value placeholder

#define FIDO_REPORT_DESC_SIZE          47                // Size of FidoReportDesc
#define DEBUG_REPORT_DESC_SIZE         34                // Size of DebugReportDesc

#define CCID_VALUE_BCDCCID                 0x0110
#define CCID_VALUE_DWPROTOCOLS             0x00000002
#define CCID_VALUE_DWDEFAULTCLOCK          3580
#define CCID_VALUE_DWMAXIUMUMCLOCK         3580
#define CCID_VALUE_DWDATARATE              9600
#define CCID_VALUE_DWMAXDATARATE           9600
#define CCID_VALUE_DWMAXIFSD               254
#define CCID_VALUE_DWSYNCPROTOCOLS         0x0
#define CCID_VALUE_DWMECHANICAL            0x0
#define CCID_VALUE_DWFEATURES              0x000400FE
#define CCID_VALUE_DWMAXCCIDMESSAGELENGTH  3072
#define CCID_VALUE_WLCDLAYOUT              0x0

#define MIN(a, b)  (((a) < (b)) ? (a) : (b))
#define MAX(a, b)  (((a) > (b)) ? (a) : (b))

#define LOBYTE(x)  ((uint8_t)( (x)        & 0x00FFU))
#define HIBYTE(x)  ((uint8_t)(((x) >> 8U) & 0x00FFU))

#define BYTE0(x)   ((uint8_t)( (x)        & 0x000000FFU))  // Least significant byte
#define BYTE1(x)   ((uint8_t)(((x) >>  8) & 0x000000FFU))  // Second byte
#define BYTE2(x)   ((uint8_t)(((x) >> 16) & 0x000000FFU))  // Third byte
#define BYTE3(x)   ((uint8_t)(((x) >> 24) & 0x000000FFU))  // Most significant byte

IDATA uint8_t FidoInterfaceNum = 0;
IDATA uint8_t CcidInterfaceNum = 0;
IDATA uint8_t DebugInterfaceNum = 0;

XDATA uint8_t ActiveCfgDesc[MAX_CFG_DESC_SIZE];
XDATA uint8_t ActiveCfgDescSize = 0;

// Device Descriptor
FLASH uint8_t DevDesc[] = {
        0x12,                             /* bLength */
        USB_DESC_TYPE_DEVICE,             /* bDescriptorType: Device */
        0x00,                             /* bcdUSB (low byte), USB Specification Release Number in Binary-Coded Decimal (2.0 is 200h) */
        0x02,                             /* bcdUSB (high byte) USB Specification Release Number in Binary-Coded Decimal (2.0 is 200h) */
        USB_DEV_CLASS_MISCELLANEOUS,      /* bDeviceClass: Miscellaneous Device Class (Composite) */
        0x02,                             /* bDeviceSubClass: Common Class */
        0x01,                             /* bDeviceProtocol: IAD (Interface Association Descriptor) */
        DEFAULT_EP0_SIZE,                 /* bMaxPacketSize */
        0x07,                             /* idVendor */            // VID LOBYTE
        0x12,                             /* idVendor */            // VID HIBYTE
        0x87,                             /* idProduct */           // PID LOBYTE
        0x88,                             /* idProduct */           // PID HIBYTE
        0x00,                             /* bcdDevice (device release number in binary-coded decimal (BCD) format, low byte, i.e. YY) rel. XX.YY */
        0x01,                             /* bcdDevice (device release number in binary-coded decimal (BCD) format, high byte, i.e. XX) rel. XX.YY */
        USB_IDX_MFC_STR,                  /* Index of manufacturer string */
        USB_IDX_PRODUCT_STR,              /* Index of product string */
        USB_IDX_SERIAL_STR,               /* Index of serial number string */
        0x01,                             /* bNumConfigurations */
        /* 18 */
};

// Configuration Descriptor
FLASH uint8_t CfgDesc[] = {
        /******************** Configuration Descriptor ********************/
        0x09,                             /* bLength: Configuration Descriptor size */
        USB_DESC_TYPE_CONFIGURATION,      /* bDescriptorType: Configuration */
        CHANGE_ME,                        /* wTotalLength (low byte): Bytes returned */
        0x00,                             /* wTotalLength (high byte): Bytes returned */
        CHANGE_ME,                        /* bNumInterfaces: 1 CDC Ctrl + 1 CDC Data, 1 FIDO or 1 CCID, 1 DEBUG ) */
        0x01,                             /* bConfigurationValue: Configuration value */
        0x00,                             /* iConfiguration: Index of string descriptor describing the configuration */
        0xA0,                             /* bmAttributes: Bus powered and Support Remote Wake-up */
        0x32,                             /* MaxPower 100 mA: this current is used for detecting Vbus */
        /* 9 */
};

// CDC Descriptor
FLASH uint8_t CdcDesc[] = {
        /******************** IAD (Interface Association Descriptor), should be positioned just before the CDC interfaces ********************/
        /******************** This is to associate the two CDC interfaces with the CDC class ********************/
        0x08,                                /* bLength: IAD Descriptor size */
        USB_DESC_TYPE_INTERFACE_ASSOCIATION, /* bDescriptorType: Interface Association */
        0x00,                                /* bFirstInterface: 0 */
        0x02,                                /* bInterfaceCount: 2 */
        USB_DEV_CLASS_CDC_CONTROL,           /* bFunctionClass: Communications & CDC Control */
        0x02,                                /* bFunctionSubClass: Abstract Control Model */
        0x01,                                /* bFunctionProtocol: Common AT commands */
        0x00,                                /* iFunction: Index of string descriptor */
        /******************** Interface, CDC Ctrl Descriptor (one endpoint) ********************/
        /* 8 */
        0x09,                             /* bLength: Interface Descriptor size */
        USB_DESC_TYPE_INTERFACE,          /* bDescriptorType: Interface */
        CHANGE_ME,                        /* bInterfaceNumber: Number of Interface */
        0x00,                             /* bAlternateSetting: Alternate setting */
        0x01,                             /* bNumEndpoints: Number of endpoints in Interface */
        USB_DEV_CLASS_CDC_CONTROL,        /* bInterfaceClass: Communications and CDC Control */
        0x02,                             /* bInterfaceSubClass : Abstract Control Model */
        0x01,                             /* bInterfaceProtocol : AT Commands: V.250 etc */
        USB_IDX_INTERFACE_CDC_CTRL_STR,   /* iInterface: Index of string descriptor */
        /******************** Header Functional Descriptor ********************/
        /* 17 */
        0x05,                             /* bFunctionLength: Size of this descriptor in bytes */
        USB_DESC_TYPE_CS_INTERFACE,       /* bDescriptorType: Class-Specific Interface */
        0x00,                             /* bDescriptorSubtype: Header Functional Descriptor */
        0x10,                             /* bcdCDC (low byte): CDC version 1.10 */
        0x01,                             /* bcdCDC (high byte): CDC version 1.10 */
        /******************** Call Management Functional Descriptor (no data interface, bmCapabilities=03, bDataInterface=01) ********************/
        /* 22 */
        0x05,                             /* bFunctionLength: Size of this descriptor */
        USB_DESC_TYPE_CS_INTERFACE,       /* bDescriptorType: Class-Specific Interface */
        0x01,                             /* bDescriptorSubtype: Call Management Functional Descriptor */
        0x00,                             /* bmCapabilities:
                                             D7..2: 0x00 (RESERVED,
                                             D1   : 0x00 (0 - Device sends/receives call management information only over the Communications Class interface
                                                          1 - Device can send/receive call management information over a Data Class interface)
                                             D0   : 0x00 (0 - Device does not handle call management itself
                                                          1 - Device handles call management itself) */
        0x00,                             /* bDataInterface: Interface number of Data Class interface optionally used for call management */
        /******************** Abstract Control Management Functional Descriptor ********************/
        /* 27 */
        0x04,                             /* bLength */
        USB_DESC_TYPE_CS_INTERFACE,       /* bDescriptorType: Class-Specific Interface */
        0x02,                             /* bDescriptorSubtype: Abstract Control Management Functional Descriptor */
        0x02,                             /* bmCapabilities:
                                             D7..4: 0x00 (RESERVED, Reset to zero)
                                             D3   : 0x00 (1 - Device supports the notification Network_Connection)
                                             D2   : 0x00 (1 - Device supports the request Send_Break)
                                             D1   : 0x01 (1 - Device supports the request combination of Set_Line_Coding, Set_Control_Line_State, Get_Line_Coding, and the notification Serial_State)
                                             D0   : 0x00 (1 - Device supports the request combination of Set_Comm_Feature, Clear_Comm_Feature, and Get_Comm_Feature) */
        /******************** Union Functional Descriptor. CDC Ctrl interface numbered 0; CDC Data interface numbered 1 ********************/
        /* 31 */
        0x05,                             /* bLength */
        USB_DESC_TYPE_CS_INTERFACE,       /* bDescriptorType: Class-Specific Interface */
        0x06,                             /* bDescriptorSubtype: Union Functional Descriptor */
        0x00,                             /* bControlInterface: Interface number 0 (Control interface) */
        0x01,                             /* bSubordinateInterface0: Interface number 1 (Data interface) */
        /******************** CDC Ctrl Endpoint descriptor (IN) ********************/
        /* 36 */
        0x07,                             /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT,           /* bDescriptorType: Endpoint */
        CDC_CTRL_EPIN_ADDR,               /* bEndpointAddress: Endpoint Address (IN) */
        USB_EP_TYPE_INTERRUPT,            /* bmAttributes: Interrupt Endpoint */
        LOBYTE(CDC_CTRL_EPIN_SIZE),       /* wMaxPacketSize (low byte): 8 Byte max */
        HIBYTE(CDC_CTRL_EPIN_SIZE),       /* wMaxPacketSize (high byte): 8 Byte max */
        CDC_CTRL_FS_BINTERVAL,            /* bInterval: Polling Interval */
        /******************** Interface, CDC Data Descriptor (two endpoints) ********************/
        /* 43 */
        0x09,                             /* bLength: Interface Descriptor size */
        USB_DESC_TYPE_INTERFACE,          /* bDescriptorType: Interface */
        CHANGE_ME,                        /* bInterfaceNumber: Number of Interface */
        0x00,                             /* bAlternateSetting: Alternate setting */
        0x02,                             /* bNumEndpoints: Number of endpoints in Interface */
        USB_DEV_CLASS_CDC_DATA,           /* bInterfaceClass: CDC Data */
        0x00,                             /* bInterfaceSubClass : 1=BOOT, 0=no boot */
        0x00,                             /* bInterfaceProtocol : 0=none, 1=keyboard, 2=mouse */
        USB_IDX_INTERFACE_CDC_DATA_STR,   /* iInterface: Index of string descriptor */
        /******************** CDC Data Endpoint descriptor (OUT) ********************/
        /* 52 */
        0x07,                             /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT,           /* bDescriptorType: Endpoint */
        CDC_DATA_EPOUT_ADDR,              /* bEndpointAddress: Endpoint Address (OUT) */
        USB_EP_TYPE_BULK,                 /* bmAttributes: Bulk Endpoint */
        LOBYTE(CDC_DATA_EPOUT_SIZE),      /* wMaxPacketSize (low byte): 64 Byte max */
        HIBYTE(CDC_DATA_EPOUT_SIZE),      /* wMaxPacketSize (high byte): 64 Byte max */
        CDC_DATA_FS_BINTERVAL,            /* bInterval: Polling Interval */
        /******************** CDC Data Endpoint descriptor (IN) ********************/
        /* 59 */
        0x07,                             /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT,           /* bDescriptorType: Endpoint */
        CDC_DATA_EPIN_ADDR,               /* bEndpointAddress: Endpoint Address (IN) */
        USB_EP_TYPE_BULK,                 /* bmAttributes: Bulk Endpoint */
        LOBYTE(CDC_DATA_EPIN_SIZE),       /* wMaxPacketSize (low byte): 64 Byte max */
        HIBYTE(CDC_DATA_EPIN_SIZE),       /* wMaxPacketSize (high byte): 64 Byte max */
        CDC_DATA_FS_BINTERVAL,            /* bInterval: Polling Interval */
        /* 66 */
};

// FIDO Descriptor
FLASH uint8_t FidoDesc[] = {
        /******************** Interface, FIDO Descriptor (two endpoints) ********************/
        0x09,                             /* bLength: Interface Descriptor size */
        USB_DESC_TYPE_INTERFACE,          /* bDescriptorType: Interface */
        CHANGE_ME,                        /* bInterfaceNumber: Number of Interface */
        0x00,                             /* bAlternateSetting: Alternate setting */
        0x02,                             /* bNumEndpoints: Number of endpoints in Interface */
        USB_DEV_CLASS_HID,                /* bInterfaceClass: Human Interface Device */
        0x00,                             /* bInterfaceSubClass : 1=BOOT, 0=no boot */
        0x00,                             /* bInterfaceProtocol : 0=none, 1=keyboard, 2=mouse */
        USB_IDX_INTERFACE_FIDO_STR,       /* iInterface: Index of string descriptor */
        /******************** FIDO Device Descriptor ********************/
        /* 9 */
        0x09,                             /* bLength: HID Descriptor size */
        USB_DESC_TYPE_HID,                /* bDescriptorType: HID */
        0x11,                             /* bcdHID (low byte): HID Class Spec release number */
        0x01,                             /* bcdHID (high byte): HID Class Spec release number */
        0x00,                             /* bCountryCode: Hardware target country */
        0x01,                             /* bNumDescriptors: Number of HID class descriptors to follow */
        USB_DESC_TYPE_REPORT,             /* bDescriptorType: Report */
        LOBYTE(FIDO_REPORT_DESC_SIZE),    /* wDescriptorLength (low byte): Total length of Report descriptor */
        HIBYTE(FIDO_REPORT_DESC_SIZE),    /* wDescriptorLength (high byte): Total length of Report descriptor */
        /******************** FIDO Endpoint Descriptor (OUT) ********************/
        /* 18 */
        0x07,                             /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT,           /* bDescriptorType: Endpoint */
        FIDO_EPOUT_ADDR,                  /* bEndpointAddress: Endpoint Address (OUT) */
        USB_EP_TYPE_INTERRUPT,            /* bmAttributes: Interrupt endpoint */
        LOBYTE(FIDO_EPOUT_SIZE),          /* wMaxPacketSize (low byte): 64 Byte max */
        HIBYTE(FIDO_EPOUT_SIZE),          /* wMaxPacketSize (high byte): 64 Byte max */
        FIDO_FS_BINTERVAL,                /* bInterval: Polling Interval */
        /******************** FIDO Endpoint Descriptor (IN) ********************/
        /* 25 */
        0x07,                             /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT,           /* bDescriptorType: Endpoint */
        FIDO_EPIN_ADDR,                   /* bEndpointAddress: Endpoint Address (IN) */
        USB_EP_TYPE_INTERRUPT,            /* bmAttributes: Interrupt endpoint */
        LOBYTE(FIDO_EPIN_SIZE),           /* wMaxPacketSize (low byte): 64 Byte max */
        HIBYTE(FIDO_EPIN_SIZE),           /* wMaxPacketSize (high byte): 64 Byte max */
        FIDO_FS_BINTERVAL,                /* bInterval: Polling Interval */
        /* 32 */
};

