tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
// CCID Descriptor
FLASH uint8_t CcidDesc[] = {
        /******************** Interface, CCID Descriptor (two endpoints) ********************/
        0x09,                             /* bLength: Interface Descriptor size */
        USB_DESC_TYPE_INTERFACE,          /* bDescriptorType: Interface */
        CHANGE_ME,                        /* bInterfaceNumber: Number of Interface */
        0x00,                             /* bAlternateSetting: Alternate setting */
        0x02,                             /* bNumEndpoints: Number of endpoints in Interface */
        USB_DEV_CLASS_SMART_CARD,         /* bInterfaceClass: Smart Card */
        0x00,                             /* bInterfaceSubClass : Subclass code */
        0x00,                             /* bInterfaceProtocol : For Integrated Circuit(s) Cards Interface Devices (CCID): 00h
                                             Note: For competitiveness, values 01h and 02h are reserved for Integrated Circuit(s)
                                             Cards Devices (USB-ICC) and other values are reserved for future use. */
        USB_IDX_INTERFACE_CCID_STR,       /* iInterface: Index of string descriptor */
        /******************** CCID Device Descriptor ********************/
        /* 9 */
        0x36,                             /* bLength: Size of this descriptor in bytes */
        USB_DESC_TYPE_HID,                /* bDescriptorType: HID */
        LOBYTE(CCID_VALUE_BCDCCID),       /* bcdCCID (low byte)*/
        HIBYTE(CCID_VALUE_BCDCCID),       /* bcdCCID (high byte): 0x0110
                                             CCID Specification Release Number in Binary-Coded Decimal (i.e., 2.10 is 0210h) */
        0x00,                             /* bMaxSlotIndex: 0
                                             The index of the highest available slot on this device.
                                             All slots are consecutive starting at 00h.
                                             i.e. 0Fh = 16 slots on this device numbered 00h to 0Fh. */
        0x07,                             /* bVoltageSupport: 7
                                             This value indicates what voltages the CCID can supply to its slots.
                                             It is a bitwise OR operation performed on the following values:
                                             - 01h 5.0V
                                             - 02h 3.0V
                                             - 04h 1.8V
                                             Other bits are RFU */
        BYTE0(CCID_VALUE_DWPROTOCOLS),    /* dwProtocols */
        BYTE1(CCID_VALUE_DWPROTOCOLS),    /* dwProtocols */
        BYTE2(CCID_VALUE_DWPROTOCOLS),    /* dwProtocols */
        BYTE3(CCID_VALUE_DWPROTOCOLS),    /* dwProtocols: T=1
                                             RRRR –Upper Word- is RFU = 0000h
                                             PPPP –Lower Word- Encodes the supported protocol types.
                                             A ‘1’ in a given bit position indicates support for the associated ISO protocol.
                                             0001h = Protocol T=0
                                             0002h = Protocol T=1
                                             All other bits are reserved and must be set to zero.
                                             The field is intended to correspond to the PCSC specification definitions.
                                             See PCSC Part3. Table 3-1 Tag 0x0120.
                                             Example: 00000003h indicates support for T = 0 and T = 1.  */
        BYTE0(CCID_VALUE_DWDEFAULTCLOCK), /* dwDefaultClock */
        BYTE1(CCID_VALUE_DWDEFAULTCLOCK), /* dwDefaultClock */
        BYTE2(CCID_VALUE_DWDEFAULTCLOCK), /* dwDefaultClock */
        BYTE3(CCID_VALUE_DWDEFAULTCLOCK), /* dwDefaultClock: 3580 KHz
                                             Default ICC clock frequency in KHz. This is an integer value.
                                             Example: 3.58 MHz is encoded as the integer value 3580. (00000DFCh)
                                             This is used in ETU and waiting time calculations.
                                             It is the clock frequency used when reading the ATR data. */
        BYTE0(CCID_VALUE_DWMAXIUMUMCLOCK),/* dwMaximumClock */
        BYTE1(CCID_VALUE_DWMAXIUMUMCLOCK),/* dwMaximumClock */
        BYTE2(CCID_VALUE_DWMAXIUMUMCLOCK),/* dwMaximumClock */
        BYTE3(CCID_VALUE_DWMAXIUMUMCLOCK),/* dwMaximumClock: 3580 KHz
                                             Maximum supported ICC clock frequency in KHz. This is an integer value.
                                             Example: 14.32 MHz is encoded as the integer value 14320. (000037F0h) */
        0x00,                             /* bNumClockSupported: 0
                                             The number of clock frequencies that are supported by the CCID.
                                             If the value is 00h, the supported clock frequencies are assumed to be the default clock
                                             frequency defined by dwDefaultClock and the maximum clock frequency defined by dwMaximumClock.
                                             The reader must implement the command PC_to_RDR_SetDataRateAndClockFrequency if more than one
                                             clock frequency is supported. */
        BYTE0(CCID_VALUE_DWDATARATE),     /* dwDataRate */
        BYTE1(CCID_VALUE_DWDATARATE),     /* dwDataRate */
        BYTE2(CCID_VALUE_DWDATARATE),     /* dwDataRate */
        BYTE3(CCID_VALUE_DWDATARATE),     /* dwDataRate: 9600 bps
                                             Default ICC I/O data rate in bps. This is an integer value.
                                             Example: 9600 bps is encoded as the integer value 9600. (00002580h) */
        BYTE0(CCID_VALUE_DWMAXDATARATE),  /* dwMaxDataRate */
        BYTE1(CCID_VALUE_DWMAXDATARATE),  /* dwMaxDataRate */
        BYTE2(CCID_VALUE_DWMAXDATARATE),  /* dwMaxDataRate */
        BYTE3(CCID_VALUE_DWMAXDATARATE),  /* dwMaxDataRate: 9600 bps
                                             Maximum supported ICC I/O data rate in bps.
                                             Example: 115.2Kbps is encoded as the integer value 115200. (0001C200h) */
        0x00,                             /* bNumDataRatesSupported: 0
                                             The number of data rates that are supported by the CCID.
                                             If the value is 00h, all data rates between the default data rate dwDataRate and the
                                             maximum data rate dwMaxDataRate are supported. */
        BYTE0(CCID_VALUE_DWMAXIFSD),      /* dwMaxIFSD */
        BYTE1(CCID_VALUE_DWMAXIFSD),      /* dwMaxIFSD */
        BYTE2(CCID_VALUE_DWMAXIFSD),      /* dwMaxIFSD */
        BYTE3(CCID_VALUE_DWMAXIFSD),      /* dwMaxIFSD: 254
                                             Indicates the maximum IFSD (Information Field Size for Device) supported by CCID for protocol T=1. */
        BYTE0(CCID_VALUE_DWSYNCPROTOCOLS),/* dwSynchProtocols */
        BYTE1(CCID_VALUE_DWSYNCPROTOCOLS),/* dwSynchProtocols */
        BYTE2(CCID_VALUE_DWSYNCPROTOCOLS),/* dwSynchProtocols */
        BYTE3(CCID_VALUE_DWSYNCPROTOCOLS),/* dwSynchProtocols: 0
                                             RRRR-Upper Word- is RFU = 0000h
                                             PPPP-Lower Word- encodes the supported protocol types.
                                             A ‘1’ in a given bit position indicates support for the associated protocol.
                                             0001h indicates support for the 2-wire protocol
                                             0002h indicates support for the 3-wire protocol
                                             0004h indicates support for the I2C protocol
                                             All other values are outside of this specification, and must be handled by vendor-supplied drivers. */
        BYTE0(CCID_VALUE_DWMECHANICAL),   /* dwMechanical */
        BYTE1(CCID_VALUE_DWMECHANICAL),   /* dwMechanical */
        BYTE2(CCID_VALUE_DWMECHANICAL),   /* dwMechanical */
        BYTE3(CCID_VALUE_DWMECHANICAL),   /* dwMechanical: 0
                                             The value is a bitwise OR operation performed on the following values:
                                             - 00000000h No special characteristics
                                             - 00000001h Card accept mechanism
                                             - 00000002h Card ejection mechanism
                                             - 00000004h Card capture mechanism
                                             - 00000008h Card lock/unlock mechanism */
        BYTE0(CCID_VALUE_DWFEATURES),     /* dwFeatures */
        BYTE1(CCID_VALUE_DWFEATURES),     /* dwFeatures */
        BYTE2(CCID_VALUE_DWFEATURES),     /* dwFeatures */
        BYTE3(CCID_VALUE_DWFEATURES),     /* dwFeatures: 0x000400FE
                                                         Automatic parameter configuration based on ATR data
                                                         Automatic activation of ICC on inserting
                                                         Automatic ICC voltage selection
                                                         Automatic ICC clock frequency change according to active parameters provided by the Host or self determined
                                                         Automatic baud rate change according to active parameters provided by the Host or self determined
                                                         Automatic parameters negotiation made by the CCID
                                                         Automatic PPS made by the CCID according to the active parameters
                                                         Short and Extended APDU level exchange with CCID
                                             This value indicates what intelligent features the CCID has.
                                             The value is a bitwise OR operation performed on the following values:
                                             - 00000000h No special characteristics
                                             - 00000002h Automatic parameter configuration based on ATR data
                                             - 00000004h Automatic activation of ICC on inserting
                                             - 00000008h Automatic ICC voltage selection
                                             - 00000010h Automatic ICC clock frequency change according to active parameters provided by the Host or self determined
                                             - 00000020h Automatic baud rate change according to active parameters provided by the Host or self determined
                                             - 00000040h Automatic parameters negotiation made by the CCID (use of warm or cold resets or PPS according to a
                                                         manufacturer proprietary algorithm to select the communication parameters with the ICC)
                                             - 00000080h Automatic PPS made by the CCID according to the active parameters
                                             - 00000100h CCID can set ICC in clock stop mode
                                             - 00000200h NAD value other than 00 accepted (T=1 protocol in use)
                                             - 00000400h Automatic IFSD exchange as first exchange (T=1 protocol in use)
                                             Only one of the following values may be present to select a level of exchange:
                                             - 00010000h TPDU level exchanges with CCID
                                             - 00020000h Short APDU level exchange with CCID
                                             - 00040000h Short and Extended APDU level exchange with CCID
                                             - If none of those values is indicated the level of exchange is character.
                                             Only one of the values 00000040h and 00000080h may be present.
                                             When value 00000040h is present the host shall not try to change the FI, DI, and protocol currently selected.
                                             When an APDU level for exchanges is selected, one of the values 00000040h or 00000080h must be present, as well as the
                                             value 00000002h.
                                             To support selective suspend:
                                             - 00100000h USB Wake up signaling supported on card insertion and removal
                                             When bit 20th, as shown above, is set bit D5 in bmAttributes of the Standard Configuration Descriptor must be set to 1. */
        BYTE0(CCID_VALUE_DWMAXCCIDMESSAGELENGTH),/* dwMaxCCIDMessageLength */
        BYTE1(CCID_VALUE_DWMAXCCIDMESSAGELENGTH),/* dwMaxCCIDMessageLength */
        BYTE2(CCID_VALUE_DWMAXCCIDMESSAGELENGTH),/* dwMaxCCIDMessageLength */
        BYTE3(CCID_VALUE_DWMAXCCIDMESSAGELENGTH),/* dwMaxCCIDMessageLength: 3072
                                                    For extended APDU level the value shall be between 261 + 10 (header) and 65544 +10,
                                                    otherwise the minimum value is the wMaxPacketSize of the Bulk-OUT endpoint. */
        0xFF,                             /* bClassGetResponse: echo
                                             Significant only for CCID that offers an APDU level for exchanges.
                                             Indicates the default class value used by the CCID when it sends a Get Response command to perform the transportation of an APDU by T=0 protocol.
                                             Value FFh indicates that the CCID echoes the class of the APDU. */
        0xFF,                             /* bClassEnvelope: echo
                                             Significant only for CCID that offers an extended APDU level for exchanges.
                                             Indicates the default class value used by the CCID when it sends an Envelope command to perform the transportation of an extended APDU by T=0 protocol.
                                             Value FFh indicates that the CCID echoes the class of the APDU.*/
        LOBYTE(CCID_VALUE_WLCDLAYOUT),    /* wLcdLayout */
        HIBYTE(CCID_VALUE_WLCDLAYOUT),    /* wLcdLayout: none
                                             Number of lines and characters for the LCD display used to send messages for PIN entry.
                                             XX: number of lines
                                             YY: number of characters per line.
                                             XXYY=0000h no LCD. */
        0x00,                             /* bPINSupport: 0
                                             This value indicates what PIN support features the CCID has.
                                             The value is a bitwise OR operation performed on the following values:
                                             0x01 PIN Verification supported
                                             0x02 PIN Modification supported */
        0x01,                             /* bMaxCCIDBusySlots: 1
                                             Maximum number of slots which can be simultaneously busy.*/
        /******************** CCID Endpoint descriptor (Bulk-OUT) ********************/
        /* 63 */
        0x07,                             /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT,           /* bDescriptorType: Endpoint */
        CCID_BULK_EPOUT_ADDR,             /* bEndpointAddress: Endpoint Address (OUT) */
        USB_EP_TYPE_BULK,                 /* bmAttributes: Bulk Endpoint */
        LOBYTE(CCID_BULK_EPOUT_SIZE),     /* wMaxPacketSize (low byte): 64 Byte max */
        HIBYTE(CCID_BULK_EPOUT_SIZE),     /* wMaxPacketSize (high byte): 64 Byte max */
        CCID_BULK_FS_BINTERVAL,                /* bInterval: Polling Interval */
        /******************** CCID Endpoint descriptor (Bulk-IN) ********************/
        /* 70 */
        0x07,                             /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT,           /* bDescriptorType: Endpoint */
        CCID_BULK_EPIN_ADDR,              /* bEndpointAddress: Endpoint Address (IN) */
        USB_EP_TYPE_BULK,                 /* bmAttributes: Bulk Endpoint */
        LOBYTE(CCID_BULK_EPIN_SIZE),      /* wMaxPacketSize (low byte): 64 Byte max */
        HIBYTE(CCID_BULK_EPIN_SIZE),      /* wMaxPacketSize (high byte): 64 Byte max */
        CCID_BULK_FS_BINTERVAL,           /* bInterval: Polling Interval */
        /* 77 */
};

// DEBUG Descriptor
FLASH uint8_t DebugDesc[] = {
        /******************** Interface, DEBUG Descriptor (two endpoints) ********************/
        0x09,                             /* bLength: Interface Descriptor size */
        USB_DESC_TYPE_INTERFACE,          /* bDescriptorType: Interface */
        CHANGE_ME,                        /* bInterfaceNumber: Number of Interface */
        0x00,                             /* bAlternateSetting: Alternate setting */
        0x02,                             /* bNumEndpoints: Number of endpoints in Interface */
        USB_DEV_CLASS_HID,                /* bInterfaceClass: Human Interface Device */
        0x00,                             /* bInterfaceSubClass : 1=BOOT, 0=no boot */
        0x00,                             /* bInterfaceProtocol : 0=none, 1=keyboard, 2=mouse */
        USB_IDX_INTERFACE_DEBUG_STR,      /* iInterface: Index of string descriptor */
        /******************** DEBUG Device Descriptor ********************/
        /* 9 */
        0x09,                             /* bLength: HID Descriptor size */
        USB_DESC_TYPE_HID,                /* bDescriptorType: HID */
        0x11,                             /* bcdHID (low byte): HID Class Spec release number */
        0x01,                             /* bcdHID (high byte): HID Class Spec release number */
        0x00,                             /* bCountryCode: Hardware target country */
        0x01,                             /* bNumDescriptors: Number of HID class descriptors to follow */
        USB_DESC_TYPE_REPORT,             /* bDescriptorType: Report */
        LOBYTE(DEBUG_REPORT_DESC_SIZE),   /* wDescriptorLength (low byte): Total length of Report descriptor */
        HIBYTE(DEBUG_REPORT_DESC_SIZE),   /* wDescriptorLength (high byte): Total length of Report descriptor */
        /******************** DEBUG Endpoint Descriptor (OUT) ********************/
        /* 18 */
        0x07,                             /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT,           /* bDescriptorType: Endpoint */
        DEBUG_EPOUT_ADDR,                 /* bEndpointAddress: Endpoint Address (OUT) */
        USB_EP_TYPE_INTERRUPT,            /* bmAttributes: Interrupt endpoint */
        LOBYTE(DEBUG_EPOUT_SIZE),         /* wMaxPacketSize (low byte): 64 Byte max */
        HIBYTE(DEBUG_EPOUT_SIZE),         /* wMaxPacketSize (high byte): 64 Byte max */
        DEBUG_FS_BINTERVAL,               /* bInterval: Polling Interval */
        /******************** DEBUG Endpoint Descriptor (IN) ********************/
        /* 25 */
        0x07,                             /* bLength: Endpoint Descriptor size */
        USB_DESC_TYPE_ENDPOINT,           /* bDescriptorType: Endpoint */
        DEBUG_EPIN_ADDR,                  /* bEndpointAddress: Endpoint Address (IN) */
        USB_EP_TYPE_INTERRUPT,            /* bmAttributes: Interrupt endpoint */
        LOBYTE(DEBUG_EPIN_SIZE),          /* wMaxPacketSize (low byte): 64 Byte max */
        HIBYTE(DEBUG_EPIN_SIZE),          /* wMaxPacketSize (high byte): 64 Byte max */
        DEBUG_FS_BINTERVAL,               /* bInterval: Polling Interval */
        /* 32 */
};

