tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
/** FIDO variables */
IDATA uint8_t FidoDataAvailable = 0;

/** CCID variables */
IDATA uint8_t CcidDataAvailable = 0;

/** Frame data */
#define MAX_FRAME_SIZE    64
XDATA uint8_t FrameBuf[MAX_FRAME_SIZE] = { 0 };
IDATA uint8_t FrameBufLength = 0;

IDATA uint8_t FrameMode   = 0;
IDATA uint8_t FrameLength = 0;
IDATA uint8_t FrameRemainingBytes = 0;
IDATA uint8_t FrameStarted = 0;
IDATA uint8_t FrameDiscard = 0;
IDATA uint8_t DiscardDataAvailable = 0;

uint32_t increment_pointer(uint32_t pointer, uint32_t increment, uint32_t buffer_size);
uint32_t decrement_pointer(uint32_t pointer, uint32_t decrement, uint32_t buffer_size);
void cts_start(void);
void cts_stop(void);
void check_cts_stop(void);

/*******************************************************************************
 * Function Name  : USBDeviceCfg()
 * Description    : USB device mode configuration
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void USBDeviceCfg()
{
    USB_CTRL = 0x00;                                       // Clear USB control register
    USB_CTRL &= ~bUC_HOST_MODE;                            // This bit selects the device mode
    USB_CTRL |= bUC_DEV_PU_EN | bUC_INT_BUSY | bUC_DMA_EN; // USB device and internal pull-up enable, automatically return to NAK before interrupt flag is cleared
    USB_DEV_AD = 0x00;                                     // Device address initialization
#if 0
    // USB_CTRL  |= bUC_LOW_SPEED;
    // UDEV_CTRL |= bUD_LOW_SPEED;                         // Select low speed 1.5M mode
#else
    USB_CTRL  &= ~bUC_LOW_SPEED;
    UDEV_CTRL &= ~bUD_LOW_SPEED;                           // Select full speed 12M mode, the default mode
#endif
    UDEV_CTRL |= bUD_PD_DIS;                               // Disable DP / DM pull-down resistor
    UDEV_CTRL |= bUD_PORT_EN;                              // Enable physical port
}

/*******************************************************************************
 * Function Name  : USBDeviceIntCfg()
 * Description    : USB device mode interrupt initialization
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void USBDeviceIntCfg()
{
    USB_INT_EN |= bUIE_SUSPEND;  // Enable device suspend interrupt
    USB_INT_EN |= bUIE_TRANSFER; // Enable USB transfer completion interrupt
    USB_INT_EN |= bUIE_BUS_RST;  // Enable device mode USB bus reset interrupt
    USB_INT_FG |= (UIF_FIFO_OV | UIF_HST_SOF | UIF_SUSPEND | UIF_TRANSFER | UIF_BUS_RST ); // Clear interrupt flag
    IE_USB = 1;                  // Enable USB interrupt
    EA = 1;                      // Allow microcontroller interrupt
}

/*******************************************************************************
 * Function Name  : USBDeviceEndPointCfg()
 * Description    : USB device mode endpoint configuration, simulation compatible
 *                  HID device, in addition to endpoint 0 control transmission,
 *                  also includes endpoint 2 batch upload
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void USBDeviceEndPointCfg()
{
    // TODO: Is casting the right thing here? What about endianness?
    UEP0_DMA = (uint16_t) Ep0Buffer; // Endpoint 0 data transfer address, Endpoint 4
    UEP1_DMA = (uint16_t) Ep1Buffer; // Endpoint 1 sends data transfer address
    UEP2_DMA = (uint16_t) Ep2Buffer; // Endpoint 2 IN data transfer address
    UEP3_DMA = (uint16_t) Ep3Buffer; // Endpoint 3 IN data transfer address

    UEP4_1_MOD = bUEP4_TX_EN | bUEP4_RX_EN | bUEP1_TX_EN;               // Endpoint 0 single 8-byte send and receive buffer
                                                                        // Endpoint 1, transmit enable
                                                                        // Endpoint 4, single buffer, transmit+receive enable
    UEP2_3_MOD = bUEP2_TX_EN | bUEP2_RX_EN | bUEP3_TX_EN | bUEP3_RX_EN; // Endpoint 2, single buffer, transmit+receive enable
                                                                        // Endpoint 3, single buffer, transmit+receive enable

    UEP0_CTRL =                 UEP_T_RES_NAK | UEP_R_RES_ACK; // Endpoint 0, manual flip, OUT transaction returns ACK, IN transaction returns NAK
    UEP1_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;                 // Endpoint 1, automatically flips the synchronization flag, IN transaction returns NAK
    UEP2_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK; // Endpoint 2, automatically flips the synchronization flag, IN transaction returns NAK, OUT returns ACK
    UEP3_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK | UEP_R_RES_ACK; // Endpoint 3, automatically flips the synchronization flag, IN transaction returns NAK, OUT returns ACK
    UEP4_CTRL =                 UEP_T_RES_NAK | UEP_R_RES_ACK; // Endpoint 4, manual flip, OUT transaction returns ACK, IN transaction returns NAK
}

void CreateCfgDescriptor(uint8_t ep_config)
{
    uint8_t num_iface = 0;   // Interface number

    FidoInterfaceNum  = 0xFF; // Set as invalid until we have parsed each interface
    CcidInterfaceNum  = 0xFF; // Set as invalid until we have parsed each interface
    DebugInterfaceNum = 0xFF; // Set as invalid until we have parsed each interface

    memset(ActiveCfgDesc, 0, MAX_CFG_DESC_SIZE); // Clean the descriptor

    uint8_t cfg_desc_size = sizeof(CfgDesc);
    memcpy(ActiveCfgDesc, CfgDesc, cfg_desc_size);
    ActiveCfgDescSize += cfg_desc_size;

    if (ep_config & IO_CDC) {
        uint8_t cdc_desc_size = sizeof(CdcDesc);
        memcpy(ActiveCfgDesc + ActiveCfgDescSize, CdcDesc, cdc_desc_size);
        ActiveCfgDesc[ActiveCfgDescSize + 10] = num_iface;
        num_iface++;
        ActiveCfgDesc[ActiveCfgDescSize + 45] = num_iface;
        num_iface++;
        ActiveCfgDescSize += cdc_desc_size;
    }

