tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
                if (SetupLen > len) {
                    SetupLen = len; // Limit total length
                }

                len = SetupLen >= DEFAULT_EP0_SIZE ? DEFAULT_EP0_SIZE : SetupLen; // This transmission length
                memcpy(Ep0Buffer, pDescr, len); // Copy upload data
                SetupLen -= len;
                pDescr += len;
            }
            break;

            case USB_SET_ADDRESS:
                SetupLen = UsbSetupBuf->wValueL; // Temporary storage of USB device address
                printStrSetup("SetAddress\n");
                break;

            case USB_GET_CONFIGURATION:
                Ep0Buffer[0] = UsbConfig;
                if (SetupLen >= 1) {
                    len = 1;
                }
                printStrSetup("GetConfig\n");
                break;

            case USB_SET_CONFIGURATION:
                UsbConfig = UsbSetupBuf->wValueL;
                printStrSetup("SetConfig\n");
                break;

            case USB_GET_INTERFACE:
                printStrSetup("GetInterface\n");
                break;

            case USB_CLEAR_FEATURE: // Clear Feature
                printStrSetup("ClearFeature\n");
                if ((UsbSetupBuf->bmRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_DEVICE) {  // Remove device
                    if ((((uint16_t) UsbSetupBuf->wValueH << 8) | UsbSetupBuf->wValueL) == 0x01) {
                        if (CfgDesc[7] & 0x20) {
                            // Wake
                        } else {
                            len = 0xFF; // Operation failed
                            printStrSetup("Unsupported\n");
                        }
                    } else {
                        len = 0xFF; // Operation failed
                        printStrSetup("Unsupported\n");
                    }
                } else if ((UsbSetupBuf->bmRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP) { // Endpoint
                    switch (UsbSetupBuf->wIndexL) {
                    case 0x84:
                        UEP4_CTRL = (UEP4_CTRL & ~(bUEP_T_TOG | MASK_UEP_T_RES)) | UEP_T_RES_NAK; // Set endpoint 4 IN (TX) NAK
                        break;
                    case 0x04:
                        UEP4_CTRL = (UEP4_CTRL & ~(bUEP_R_TOG | MASK_UEP_R_RES)) | UEP_R_RES_ACK; // Set endpoint 4 OUT (RX) ACK
                        break;
                    case 0x83:
                        UEP3_CTRL = (UEP3_CTRL & ~(bUEP_T_TOG | MASK_UEP_T_RES)) | UEP_T_RES_NAK; // Set endpoint 3 IN (TX) NAK
                        break;
                    case 0x03:
                        UEP3_CTRL = (UEP3_CTRL & ~(bUEP_R_TOG | MASK_UEP_R_RES)) | UEP_R_RES_ACK; // Set endpoint 3 OUT (RX) ACK
                        break;
                    case 0x82:
                        UEP2_CTRL = (UEP2_CTRL & ~(bUEP_T_TOG | MASK_UEP_T_RES)) | UEP_T_RES_NAK; // Set endpoint 2 IN (TX) NACK
                        break;
                    case 0x02:
                        UEP2_CTRL = (UEP2_CTRL & ~(bUEP_R_TOG | MASK_UEP_R_RES)) | UEP_R_RES_ACK; // Set endpoint 2 OUT (RX) ACK
                        break;
                    case 0x81:
                        UEP1_CTRL = (UEP1_CTRL & ~(bUEP_T_TOG | MASK_UEP_T_RES)) | UEP_T_RES_NAK; // Set endpoint 1 IN (TX) NACK
                        break;
                    case 0x01:
                        UEP1_CTRL = (UEP1_CTRL & ~(bUEP_R_TOG | MASK_UEP_R_RES)) | UEP_R_RES_ACK; // Set endpoint 1 OUT (RX) ACK
                        break;
                    default:
                        len = 0xFF;  // Unsupported endpoint
                        printStrSetup("Unsupported\n");
                        break;
                    }
                } else {
                    len = 0xFF; // It's not that the endpoint doesn't support it
                    printStrSetup("Unsupported\n");
                }
                break;

            case USB_SET_FEATURE: // Set Feature
                printStrSetup("SetFeature\n");
                if (( UsbSetupBuf->bmRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_DEVICE) { // Set up the device
                    if ((((uint16_t) UsbSetupBuf->wValueH << 8) | UsbSetupBuf->wValueL) == 0x01) {
                        if (CfgDesc[7] & 0x20) {
                            printStrSetup("Suspend\n");
                            while (XBUS_AUX & bUART0_TX) {
                                ; // Wait for sending to complete
                            }
                            SAFE_MOD = 0x55;
                            SAFE_MOD = 0xAA;
                            WAKE_CTRL = bWAK_BY_USB | bWAK_RXD0_LO | bWAK_RXD1_LO; // USB or RXD0/1 can be woken up when there is a signal
                            PCON |= PD; // Sleep
                            SAFE_MOD = 0x55;
                            SAFE_MOD = 0xAA;
                            WAKE_CTRL = 0x00;
                        } else {
                            len = 0xFF; // Operation failed
                        }
                    } else {
                        len = 0xFF; // Operation failed
                    }
                } else if (( UsbSetupBuf->bmRequestType & USB_REQ_RECIP_MASK) == USB_REQ_RECIP_ENDP) { // Set endpoint
                    if ((((uint16_t) UsbSetupBuf->wValueH << 8) | UsbSetupBuf->wValueL) == 0x00) {
                        switch (((uint16_t) UsbSetupBuf->wIndexH << 8) | UsbSetupBuf->wIndexL) {
                        case 0x84:
                            UEP4_CTRL = (UEP4_CTRL & ~bUEP_T_TOG) | UEP_T_RES_STALL; // Set endpoint 4 IN (TX) Stall (error)
                            break;
                        case 0x04:
                            UEP4_CTRL = (UEP4_CTRL & ~bUEP_R_TOG) | UEP_R_RES_STALL; // Set endpoint 4 OUT (RX) Stall (error)
                            break;
                        case 0x83:
                            UEP3_CTRL = (UEP3_CTRL & ~bUEP_T_TOG) | UEP_T_RES_STALL; // Set endpoint 3 IN (TX) Stall (error)
                            break;
                        case 0x03:
                            UEP3_CTRL = (UEP3_CTRL & ~bUEP_R_TOG) | UEP_R_RES_STALL; // Set endpoint 3 OUT (RX) Stall (error)
                            break;
                        case 0x82:
                            UEP2_CTRL = (UEP2_CTRL & ~bUEP_T_TOG) | UEP_T_RES_STALL; // Set endpoint 2 IN (TX) Stall (error)
                            break;
                        case 0x02:
                            UEP2_CTRL = (UEP2_CTRL & ~bUEP_R_TOG) | UEP_R_RES_STALL; // Set endpoint 2 OUT (RX) Stall (error)
                            break;
                        case 0x81:
                            UEP1_CTRL = (UEP1_CTRL & ~bUEP_T_TOG) | UEP_T_RES_STALL; // Set endpoint 1 IN (TX) Stall (error)
                            break;
                        case 0x01:
                            UEP1_CTRL = (UEP1_CTRL & ~bUEP_R_TOG) | UEP_R_RES_STALL; // Set endpoint 1 OUT (RX) Stall (error)
                        default:
                            len = 0xFF; // Operation failed
                            break;
                        }
                    } else {
                        len = 0xFF; // Operation failed
                        printStrSetup("Unsupported\n");
                    }
                } else {
                    len = 0xFF; // Operation failed
                    printStrSetup("Unsupported\n");
                }
                break;

