tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
            case USB_GET_STATUS:
                printStrSetup("GetStatus\n");
                Ep0Buffer[0] = 0x00;
                Ep0Buffer[1] = 0x00;
                if (SetupLen >= 2) {
                    len = 2;
                } else {
                    len = SetupLen;
                }
                break;

            default:
                len = 0xFF; // Operation failed
                printStrSetup("Unsupported\n");
                break;

            } // END switch (SetupReq)
        } // END Standard request
    } else {
        len = 0xFF; // Packet length error
    }

    if (len == 0xFF) {
        SetupReq = 0xFF;
        UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_STALL | UEP_T_RES_STALL; // STALL
    } else if (len <= DEFAULT_EP0_SIZE) { // Upload data or status phase returns 0 length packet
        UEP0_T_LEN = len;
        UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_ACK | UEP_T_RES_ACK; // The default packet is DATA1, return response ACK
    } else {
        UEP0_T_LEN = 0; // Although it has not yet reached the status stage, it is preset to upload 0-length data packets in advance to prevent the host from entering the status stage early.
        UEP0_CTRL = bUEP_R_TOG | bUEP_T_TOG | UEP_R_RES_ACK | UEP_T_RES_ACK; // The default data packet is DATA1, and the response ACK is returned
    }
}

/*******************************************************************************
 * Function Name  : DeviceInterrupt()
 * Description    : CH559USB interrupt processing function
 *******************************************************************************/
#ifdef BUILD_CODE
#define IRQ_USB __interrupt(INT_NO_USB)
#else
#define IRQ_USB
#endif

void DeviceInterrupt(void)IRQ_USB // USB interrupt service routine, using register set 1
{
    uint16_t len;

    if (UIF_TRANSFER) { // Check USB transfer complete flag
        switch (USB_INT_ST & (MASK_UIS_TOKEN | MASK_UIS_ENDP)) {

        case UIS_TOKEN_SETUP | 0: // SETUP routine
            usb_irq_setup_handler();
            break;

        case UIS_TOKEN_IN | 0: // Endpoint 0 IN (TX)
            switch (SetupReq) {
            case USB_GET_DESCRIPTOR:
                len = SetupLen >= DEFAULT_EP0_SIZE ? DEFAULT_EP0_SIZE : SetupLen; // The length of this transmission
                memcpy(Ep0Buffer, pDescr, len); // Load upload data
                SetupLen -= len;
                pDescr += len;
                UEP0_T_LEN = len;
                UEP0_CTRL ^= bUEP_T_TOG; // Sync flag flip
                break;
            case USB_SET_ADDRESS:
                USB_DEV_AD = (USB_DEV_AD & bUDA_GP_BIT) | SetupLen;
                UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
                break;
            default:
                UEP0_T_LEN = 0; // The status phase is completed and interrupted or the 0-length data packet is forced to be uploaded to end the control transmission.
                UEP0_CTRL = UEP_R_RES_ACK | UEP_T_RES_NAK;
                break;
            }
            break;

        case UIS_TOKEN_IN | 1: // Endpoint 1 IN (TX), Endpoint interrupts upload
            UEP1_T_LEN = 0;    // Transmit length must be cleared (Endpoint 1)
            UEP1_CTRL = (UEP1_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_NAK; // Default answer NAK
            break;

        case UIS_TOKEN_IN | 2: // Endpoint 2 IN (TX), Endpoint bulk upload
            UEP2_T_LEN = 0;    // Transmit length must be cleared (Endpoint 2)
            UEP2_CTRL = (UEP2_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_NAK; // Default answer NAK
            Endpoint2UploadBusy = 0; // Clear busy flag
            break;

        case UIS_TOKEN_IN | 3: // Endpoint 3 IN (TX), Endpoint bulk upload
            UEP3_T_LEN = 0;    // Transmit length must be cleared (Endpoint 3)
            UEP3_CTRL = (UEP3_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_NAK; // Default answer NAK
            Endpoint3UploadBusy = 0; // Clear busy flag
            break;

        case UIS_TOKEN_IN | 4: // Endpoint 4 IN (TX), Endpoint bulk upload
            UEP4_T_LEN = 0;    // Transmit length must be cleared (Endpoint 4)
            UEP4_CTRL = (UEP4_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_NAK; // Default answer NAK
            UEP4_CTRL ^= bUEP_T_TOG; // Sync flag flip
            Endpoint4UploadBusy = 0; // Clear busy flag
            break;

        case UIS_TOKEN_OUT | 0: // Endpoint 0 OUT (RX)
            switch (SetupReq) {
            case USB_CDC_REQ_TYPE_SET_LINE_CODING: // We ignore line coding here because baudrate to the FPGA should not change
                if (U_TOG_OK) {
                    UEP0_T_LEN = 0;
                    UEP0_CTRL |= UEP_R_RES_ACK | UEP_T_RES_ACK; // Prepare to upload 0 packages
                }
                break;
            default:
                UEP0_T_LEN = 0;
                UEP0_CTRL |= UEP_R_RES_ACK | UEP_T_RES_NAK; // Status phase, responds to IN with NAK
            }
            break;

        case UIS_TOKEN_OUT | 1: // Endpoint 1 OUT (RX), Disabled for now.
            // Out-of-sync packets will be dropped
            if (U_TOG_OK) {
                //UsbEpXByteCount = USB_RX_LEN;                              // Length of received data
                //UEP1_CTRL = (UEP1_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_NAK; // NAK after receiving a packet of data, the main function finishes processing, and the main function modifies the response mode
            }
            break;

        case UIS_TOKEN_OUT | 2: // Endpoint 2 OUT (RX), Endpoint batch download
            // Out-of-sync packets will be dropped
            if (U_TOG_OK) {
                UsbEp2ByteCount = USB_RX_LEN;                              // Length of received data
                UEP2_CTRL = (UEP2_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_NAK; // NAK after receiving a packet of data, the main function finishes processing, and the main function modifies the response mode
            }
            break;

        case UIS_TOKEN_OUT | 3: // Endpoint 3 OUT (RX), Endpoint batch download
            // Out-of-sync packets will be dropped
            if (U_TOG_OK) {
                UsbEp3ByteCount = USB_RX_LEN;                              // Length of received data
                UEP3_CTRL = (UEP3_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_NAK; // NAK after receiving a packet of data, the main function finishes processing, and the main function modifies the response mode
            }
            break;

