tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
    // Always enable CDC endpoint
    if ((ActiveEndpoints & IO_CDC) == 0x0) {
        ActiveEndpoints |= IO_CDC;
    }

    // Always enable CH552 endpoint
    if ((ActiveEndpoints & IO_CH552) == 0x0) {
        ActiveEndpoints |= IO_CH552;
    }

    // FIDO and CCID can't be enabled at the same time. Disable both!
    if ((ActiveEndpoints & IO_FIDO) && (ActiveEndpoints & IO_CCID)) {
        ActiveEndpoints &= ~(IO_FIDO | IO_CCID);
    }

    CreateCfgDescriptor(ActiveEndpoints);

    USBDeviceCfg();
    USBDeviceEndPointCfg(); // Endpoint configuration
    USBDeviceIntCfg();      // Interrupt initialization

    UEP0_T_LEN = 0;         // Transmit length must be cleared (Endpoint 0)
    UEP1_T_LEN = 0;         // Transmit length must be cleared (Endpoint 1)
    UEP2_T_LEN = 0;         // Transmit length must be cleared (Endpoint 2)
    UEP3_T_LEN = 0;         // Transmit length must be cleared (Endpoint 3)
    UEP4_T_LEN = 0;         // Transmit length must be cleared (Endpoint 4)

    gpio_init_p1_4_in();    // Init GPIO p1.4 to input mode for FPGA_CTS
    gpio_init_p1_5_out();   // Init GPIO p1.5 to output mode for CH552_CTS
    cts_start();            // Signal OK to send

    while (1) {
        if (UsbConfig) {

            // Check if Endpoint 2 (CDC) has received data
            if (UsbEp2ByteCount) {
                Ep2ByteLen = UsbEp2ByteCount; // UsbEp2ByteCount can be maximum 64 bytes
                memcpy(UartTxBuf, Ep2Buffer, Ep2ByteLen);

                UsbEp2ByteCount = 0;
                CH554UART1SendByte(IO_CDC);  // Send CDC mode header
                CH554UART1SendByte(Ep2ByteLen);  // Send length
                CH554UART1SendBuffer(UartTxBuf, Ep2ByteLen);
                UEP2_CTRL = (UEP2_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_ACK; // Enable Endpoint 2 to ACK again
            }

            // Check if Endpoint 3 (FIDO or CCID) has received data
            if (UsbEp3ByteCount) {
                Ep3ByteLen = UsbEp3ByteCount; // UsbEp3ByteCount can be maximum 64 bytes
                memcpy(UartTxBuf, Ep3Buffer, Ep3ByteLen);

                UsbEp3ByteCount = 0;
                if (ActiveEndpoints & IO_FIDO) {
                    CH554UART1SendByte(IO_FIDO); // Send FIDO mode header
                } else if (ActiveEndpoints & IO_CCID) {
                    CH554UART1SendByte(IO_CCID); // Send CCID mode header
                }
                CH554UART1SendByte(Ep3ByteLen); // Send length (always 64 bytes for FIDO, variable for CCID)
                CH554UART1SendBuffer(UartTxBuf, Ep3ByteLen);
                UEP3_CTRL = (UEP3_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_ACK; // Enable Endpoint 3 to ACK again
            }

            // Check if Endpoint 4 (DEBUG) has received data
            if (UsbEp4ByteCount) {
                Ep4ByteLen = UsbEp4ByteCount; // UsbEp4ByteCount can be maximum 64 bytes
                memcpy(UartTxBuf, Ep0Buffer+64, Ep4ByteLen); // Endpoint 4 receive is at address UEP0_DMA+64

                UsbEp4ByteCount = 0;
                CH554UART1SendByte(IO_DEBUG); // Send DEBUG mode header
                CH554UART1SendByte(Ep4ByteLen); // Send length (always 64 bytes)
                CH554UART1SendBuffer(UartTxBuf, Ep4ByteLen);
                UEP4_CTRL = (UEP4_CTRL & ~MASK_UEP_R_RES) | UEP_R_RES_ACK; // Enable Endpoint 4 to ACK again
            }

            UartRxBufByteCount = uart_byte_count(); // Check amount of data in buffer

            if ((UartRxBufByteCount >= 2) && !FrameStarted) {  // If we have data and the header is not yet validated
                FrameMode = UartRxBuf[UartRxBufOutputPointer]; // Extract frame mode
                if ((FrameMode == IO_CDC)   ||
                    (FrameMode == IO_FIDO)  ||
                    (FrameMode == IO_CCID)  ||
                    (FrameMode == IO_DEBUG) ||
                    (FrameMode == IO_CH552)) {

                    FrameLength = UartRxBuf[increment_pointer(UartRxBufOutputPointer,
                                                              1,
                                                              UART_RX_BUF_SIZE)]; // Extract frame length
                    FrameRemainingBytes = FrameLength;
                    UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                               2,
                                                               UART_RX_BUF_SIZE); // Start at valid data so skip the mode and length byte
                    UartRxBufByteCount -= 2; // Subtract the frame mode and frame length bytes from the total byte count
                    FrameStarted = 1;

                    // Mark that we should discard data if destination for the frame is not active
                    if ((FrameMode & ActiveEndpoints) == 0) {
                        FrameDiscard = 1;
                    }

                } else { // Invalid frame mode

                    cts_stop();

                    // Reset CH552 to start from a known state
                    SAFE_MOD = 0x55;
                    SAFE_MOD = 0xAA;
                    GLOBAL_CFG = bSW_RESET;
                    while (1)
                        ;
                }
            }

            // Copy CDC data from UartRxBuf to FrameBuf
            if (FrameStarted && !FrameDiscard && !CdcDataAvailable) {
                if (FrameMode == IO_CDC) {
                    if ((FrameRemainingBytes >= MAX_FRAME_SIZE) &&
                        (UartRxBufByteCount >= MAX_FRAME_SIZE)) {
                        circular_copy(FrameBuf,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      MAX_FRAME_SIZE);
                        FrameBufLength = MAX_FRAME_SIZE;
                        // Update output pointer
                        UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                                   MAX_FRAME_SIZE,
                                                                   UART_RX_BUF_SIZE);
                        FrameRemainingBytes -= MAX_FRAME_SIZE;
                        CdcDataAvailable = 1;
                        cts_start();
                    }
                    else if ((FrameRemainingBytes < MAX_FRAME_SIZE) &&
                             (UartRxBufByteCount >= FrameRemainingBytes)) {
                        circular_copy(FrameBuf,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      FrameRemainingBytes);
                        FrameBufLength = FrameRemainingBytes;
                        // Update output pointer
                        UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                                   FrameRemainingBytes,
                                                                   UART_RX_BUF_SIZE);
                        FrameRemainingBytes -= FrameRemainingBytes;
                        CdcDataAvailable = 1;
                        cts_start();
                    }
                }
            }

            // Copy FIDO data from UartRxBuf to FrameBuf
            if (FrameStarted && !FrameDiscard && !FidoDataAvailable) {
                if (FrameMode == IO_FIDO) {
                    // Check if a complete frame has been received
                    if (UartRxBufByteCount >= FrameRemainingBytes) {
                        circular_copy(FrameBuf,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      FrameRemainingBytes);
                        FrameBufLength = MAX_FRAME_SIZE;
                        // Update output pointer
                        UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                                   FrameRemainingBytes,
                                                                   UART_RX_BUF_SIZE);
                        FidoDataAvailable = 1;
                        cts_start();
                    }
                }
            }

