tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
            // Copy CCID data from UartRxBuf to FrameBuf
            if (FrameStarted && !FrameDiscard && !CcidDataAvailable) {
                if (FrameMode == IO_CCID) {
                    if ((FrameRemainingBytes >= MAX_FRAME_SIZE) &&
                        (UartRxBufByteCount >= MAX_FRAME_SIZE)) {
                        circular_copy(FrameBuf,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      MAX_FRAME_SIZE);
                        FrameBufLength = MAX_FRAME_SIZE;
                        // Update output pointer
                        UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                                   MAX_FRAME_SIZE,
                                                                   UART_RX_BUF_SIZE);
                        FrameRemainingBytes -= MAX_FRAME_SIZE;
                        CcidDataAvailable = 1;
                        cts_start();
                    }
                    else if ((FrameRemainingBytes < MAX_FRAME_SIZE) &&
                             (UartRxBufByteCount >= FrameRemainingBytes)) {
                        circular_copy(FrameBuf,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      FrameRemainingBytes);
                        FrameBufLength = FrameRemainingBytes;
                        // Update output pointer
                        UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                                   FrameRemainingBytes,
                                                                   UART_RX_BUF_SIZE);
                        FrameRemainingBytes -= FrameRemainingBytes;
                        CcidDataAvailable = 1;
                        cts_start();
                    }
                }
            }

            // Copy DEBUG data from UartRxBuf to FrameBuf
            if (FrameStarted && !FrameDiscard && !DebugDataAvailable) {
                if (FrameMode == IO_DEBUG) {
                    if ((FrameRemainingBytes >= MAX_FRAME_SIZE) &&
                        (UartRxBufByteCount >= MAX_FRAME_SIZE)) {
                        circular_copy(FrameBuf,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      MAX_FRAME_SIZE);
                        FrameBufLength = MAX_FRAME_SIZE;
                        // Update output pointer
                        UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                                   MAX_FRAME_SIZE,
                                                                   UART_RX_BUF_SIZE);
                        FrameRemainingBytes -= MAX_FRAME_SIZE;
                        DebugDataAvailable = 1;
                        cts_start();
                    }
                    else if ((FrameRemainingBytes < MAX_FRAME_SIZE) &&
                             (UartRxBufByteCount >= FrameRemainingBytes)) {
                        circular_copy(FrameBuf,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      FrameRemainingBytes);
                        FrameBufLength = FrameRemainingBytes;
                        // Update output pointer
                        UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                                   FrameRemainingBytes,
                                                                   UART_RX_BUF_SIZE);
                        FrameRemainingBytes -= FrameRemainingBytes;
                        DebugDataAvailable = 1;
                        cts_start();
                    }
                }
            }

            // Copy CH552 data from UartRxBuf to FrameBuf
            if (FrameStarted && !FrameDiscard && !CH552DataAvailable) {
                if (FrameMode == IO_CH552) {
                    if ((FrameRemainingBytes >= MAX_FRAME_SIZE) &&
                        (UartRxBufByteCount >= MAX_FRAME_SIZE)) {
                        circular_copy(FrameBuf,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      MAX_FRAME_SIZE);
                        FrameBufLength = MAX_FRAME_SIZE;
                        // Update output pointer
                        UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                                   MAX_FRAME_SIZE,
                                                                   UART_RX_BUF_SIZE);
                        FrameRemainingBytes -= MAX_FRAME_SIZE;
                        CH552DataAvailable = 1;
                        cts_start();
                    }
                    else if ((FrameRemainingBytes < MAX_FRAME_SIZE) &&
                             (UartRxBufByteCount >= FrameRemainingBytes)) {
                        circular_copy(FrameBuf,
                                      UartRxBuf,
                                      UART_RX_BUF_SIZE,
                                      UartRxBufOutputPointer,
                                      FrameRemainingBytes);
                        FrameBufLength = FrameRemainingBytes;
                        // Update output pointer
                        UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                                   FrameRemainingBytes,
                                                                   UART_RX_BUF_SIZE);
                        FrameRemainingBytes -= FrameRemainingBytes;
                        CH552DataAvailable = 1;
                        cts_start();
                    }
                }
            }

            // Discard frame
            if (FrameStarted && FrameDiscard && !DiscardDataAvailable) {
                if ((FrameRemainingBytes >= MAX_FRAME_SIZE) &&
                    (UartRxBufByteCount >= MAX_FRAME_SIZE)) {
                    // Update output pointer
                    UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                               MAX_FRAME_SIZE,
                                                               UART_RX_BUF_SIZE);
                    FrameRemainingBytes -= MAX_FRAME_SIZE;
                    DiscardDataAvailable = 1;
                    cts_start();
                }
                else if ((FrameRemainingBytes < MAX_FRAME_SIZE) &&
                        (UartRxBufByteCount >= FrameRemainingBytes)) {
                    // Update output pointer
                    UartRxBufOutputPointer = increment_pointer(UartRxBufOutputPointer,
                                                               FrameRemainingBytes,
                                                               UART_RX_BUF_SIZE);
                    FrameRemainingBytes -= FrameRemainingBytes;
                    DiscardDataAvailable = 1;
                    cts_start();
                }
            }

            // Check if we should upload data to Endpoint 2 (CDC)
            if (CdcDataAvailable && !Endpoint2UploadBusy) {

