tillitis/tillitis-key1/hw/usb_interface/ch552_fw/src/main.c
                // Write upload endpoint
                memcpy(Ep2Buffer + MAX_PACKET_SIZE, /* Copy to IN buffer of Endpoint 2 */
                       FrameBuf,
                       FrameBufLength);

                Endpoint2UploadBusy = 1; // Set busy flag
                UEP2_T_LEN = FrameBufLength; // Set the number of data bytes that Endpoint 2 is ready to send
                UEP2_CTRL = (UEP2_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK

                CdcDataAvailable = 0;
                FrameBufLength = 0;

                if (FrameRemainingBytes == 0) {
                    // Complete frame sent, get next header and data
                    FrameStarted = 0;
                }
            }

            // Check if we should upload data to Endpoint 3 (FIDO)
            if (FidoDataAvailable && !Endpoint3UploadBusy) {

                // Write upload endpoint
                memcpy(Ep3Buffer + MAX_PACKET_SIZE, /* Copy to IN buffer of Endpoint 3 */
                       FrameBuf,
                       FrameBufLength);

                Endpoint3UploadBusy = 1; // Set busy flag
                UEP3_T_LEN = MAX_PACKET_SIZE; // Set the number of data bytes that Endpoint 3 is ready to send
                UEP3_CTRL = (UEP3_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK

                FidoDataAvailable = 0;
                FrameBufLength = 0;

                // Get next header and data
                FrameStarted = 0;
            }

            // Check if we should upload data to Endpoint 3 (CCID)
            if (CcidDataAvailable && !Endpoint3UploadBusy) {

                // Write upload endpoint
                memcpy(Ep3Buffer + MAX_PACKET_SIZE, /* Copy to IN buffer of Endpoint 3 */
                       FrameBuf,
                       FrameBufLength);

                Endpoint3UploadBusy = 1; // Set busy flag
                UEP3_T_LEN = FrameBufLength; // Set the number of data bytes that Endpoint 3 is ready to send
                UEP3_CTRL = (UEP3_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK

                CcidDataAvailable = 0;
                FrameBufLength = 0;

                // Get next header and data
                FrameStarted = 0;
            }

            // Check if we should upload data to Endpoint 4 (DEBUG)
            if (DebugDataAvailable && !Endpoint4UploadBusy) {

                if (FrameBufLength == MAX_PACKET_SIZE) {
                    // Write upload endpoint
                    memcpy(Ep0Buffer + 128, /* Copy to IN (TX) buffer of Endpoint 4 */
                           FrameBuf,
                           FrameBufLength);
                } else {
                    memset(Ep0Buffer + 128, 0, MAX_PACKET_SIZE);
                    // Write upload endpoint
                    memcpy(Ep0Buffer + 128, /* Copy to IN (TX) buffer of Endpoint 4 */
                           FrameBuf,
                           FrameBufLength);
                }

                Endpoint4UploadBusy = 1; // Set busy flag
                UEP4_T_LEN = MAX_PACKET_SIZE; // Set the number of data bytes that Endpoint 4 is ready to send
                UEP4_CTRL = (UEP4_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK; // Answer ACK

                DebugDataAvailable = 0;
                FrameBufLength = 0;

                if (FrameRemainingBytes == 0) {
                    // Complete frame sent, get next header and data
                    FrameStarted = 0;
                }
            }

            // Check if we should handle CH552 data
            if (CH552DataAvailable) {

                switch (FrameBuf[0]) {

                    case SET_ENDPOINTS: {
                        cts_stop(); // Stop UART data from FPGA
                        RESET_KEEP = FrameBuf[1]; // Save endpoints to persistent register
                        SAFE_MOD = 0x55; // Start reset sequence
                        SAFE_MOD = 0xAA;
                        GLOBAL_CFG = bSW_RESET;
                        while (1)
                            ;
                    }
                    break;

                    default: {
                    }
                    break;

                }

                CH552DataAvailable = 0;
                FrameBufLength = 0;

                memset(FrameBuf, 0, MAX_FRAME_SIZE);

                if (FrameRemainingBytes == 0) {
                    // Complete frame sent, get next header and data
                    FrameStarted = 0;
                }
            }

            if (DiscardDataAvailable) {

                DiscardDataAvailable = 0;
                printStr("Frame discarded!\n");

                if (FrameRemainingBytes == 0) {
                    // Complete frame discarded, get next header and data
                    FrameStarted = 0;
                    // Stop discarding frames
                    FrameDiscard = 0;
                }
            }

        } /* END if (UsbConfig) */
    } /* END while (1) */
}
